---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookStartType
source: html/7bbdc8de-dc54-3b38-7cb0-47008eca1c7c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookStartType Property

"Hook At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeHookStartType { get; }
```